app/Models/UserModel.php

    public function show_all_data()
    {
        $builder = $this->db->table('tbl_user u');
        $builder->select('u.id, u.name, u.contact_p, u.number, u.email, u.gender, c.c_name AS country_name, s.s_name AS state_name, d.d_name AS district_name, u.p_address, u.c_address, u.status');
        $builder->join('country c', 'u.country = c.c_id');
        $builder->join('state s', 'u.state = s.s_id');
        $builder->join('district d', 'u.city = d.d_id');
        $builder->where('u.status', 'ACTIVE');
        $query = $builder->get();
---
SELECT `u`.`id`, `u`.`name`, `u`.`contact_p`, `u`.`number`, `u`.`email`, `u`.`gender`, `c`.`c_name` AS `country_name`, `s`.`s_name` AS `state_name`, `d`.`d_name` AS `district_name`, `u`.`p_address`, `u`.`c_address`, `u`.`status`
FROM `tbl_user` `u`
JOIN `country` `c` ON `u`.`country` = `c`.`c_id`
JOIN `state` `s` ON `u`.`state` = `s`.`s_id`
JOIN `district` `d` ON `u`.`city` = `d`.`d_id`
WHERE `u`.`status` = 'ACTIVE'

    public function pageload_data()
    {
        $query = $this->db->table('country')->get();
---
SELECT *
FROM `country`